Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/fuses.h
/* -------- FUSES_KEYVAL_TZ0_CE_ALL : (FUSES Offset: 0x80) (R/W 32) Chip Erase Key for TZ0_ALL -------- */
#define FUSES_KEYVAL_TZ0_CE_ALL_Msk           _UINT32_(0x00000000)                                 /* (FUSES_KEYVAL_TZ0_CE_ALL) Register Mask  */


/* -------- FUSES_CELOCK_TZ0_CE_ALL : (FUSES Offset: 0x90) (R/W 32) Chip Erase Lock for TZ0_ALL -------- */
#define FUSES_CELOCK_TZ0_CE_ALL_Msk           _UINT32_(0x00000000)                                 /* (FUSES_CELOCK_TZ0_CE_ALL) Register Mask  */


/* -------- FUSES_KEYVAL_CRCCMD : (FUSES Offset: 0xA0) (R/W 32) CRC Access Key -------- */
#define FUSES_KEYVAL_CRCCMD_Msk               _UINT32_(0x00000000)                                 /* (FUSES_KEYVAL_CRCCMD) Register Mask  */


/* -------- FUSES_KEYCONFIG_CRCCMD : (FUSES Offset: 0xB0) (R/W 32) CRC Access Key Configuration -------- */
#define FUSES_KEYCONFIG_CRCCMD_Msk            _UINT32_(0x00000000)                                 /* (FUSES_KEYCONFIG_CRCCMD) Register Mask  */


/* -------- FUSES_KEYVAL_HOSTDALELEV : (FUSES Offset: 0xC0) (R/W 32) Host Authenticated DAL Elevation Key -------- */
#define FUSES_KEYVAL_HOSTDALELEV_Msk          _UINT32_(0x00000000)                                 /* (FUSES_KEYVAL_HOSTDALELEV) Register Mask  */


/* -------- FUSES_KEYCONFIG_HOSTDALELEV : (FUSES Offset: 0xD0) (R/W 32) Host Authenticated DAL Elevation Key Configuration -------- */
#define FUSES_KEYCONFIG_HOSTDALELEV_Msk       _UINT32_(0x00000000)                                 /* (FUSES_KEYCONFIG_HOSTDALELEV) Register Mask  */


/* -------- FUSES_ROM_CTRLA : (FUSES Offset: 0xE0) (R/W 32) ROM CTRLA Settings  (BROM_PLLEN must be set) -------- */
#define FUSES_ROM_CTRLA_SWRST_Pos             _UINT32_(1)                                          /* (FUSES_ROM_CTRLA) Software Reset Position */
#define FUSES_ROM_CTRLA_SWRST_Msk             (_UINT32_(0x1) << FUSES_ROM_CTRLA_SWRST_Pos)         /* (FUSES_ROM_CTRLA) Software Reset Mask */
#define FUSES_ROM_CTRLA_SWRST(value)          (FUSES_ROM_CTRLA_SWRST_Msk & (_UINT32_(value) << FUSES_ROM_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the FUSES_ROM_CTRLA register */
#define FUSES_ROM_CTRLA_ENABLE_Pos            _UINT32_(2)                                          /* (FUSES_ROM_CTRLA) Module Enable Position */
#define FUSES_ROM_CTRLA_ENABLE_Msk            (_UINT32_(0x1) << FUSES_ROM_CTRLA_ENABLE_Pos)        /* (FUSES_ROM_CTRLA) Module Enable Mask */
#define FUSES_ROM_CTRLA_ENABLE(value)         (FUSES_ROM_CTRLA_ENABLE_Msk & (_UINT32_(value) << FUSES_ROM_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the FUSES_ROM_CTRLA register */
#define FUSES_ROM_CTRLA_PRMWS_Pos             _UINT32_(8)                                          /* (FUSES_ROM_CTRLA) Wait States Position */
#define FUSES_ROM_CTRLA_PRMWS_Msk             (_UINT32_(0x7) << FUSES_ROM_CTRLA_PRMWS_Pos)         /* (FUSES_ROM_CTRLA) Wait States Mask */
#define FUSES_ROM_CTRLA_PRMWS(value)          (FUSES_ROM_CTRLA_PRMWS_Msk & (_UINT32_(value) << FUSES_ROM_CTRLA_PRMWS_Pos)) /* Assigment of value for PRMWS in the FUSES_ROM_CTRLA register */
#define FUSES_ROM_CTRLA_Msk                   _UINT32_(0x00000706)                                 /* (FUSES_ROM_CTRLA) Register Mask  */


/* -------- FUSES_FCR_CTRLA : (FUSES Offset: 0xE4) (R/W 32) FCR CTRLA Settings (BROM_PLLEN must be set) -------- */
#define FUSES_FCR_CTRLA_ARB_Pos               _UINT32_(2)                                          /* (FUSES_FCR_CTRLA) AHB Arbitration scheme Position */
#define FUSES_FCR_CTRLA_ARB_Msk               (_UINT32_(0x1) << FUSES_FCR_CTRLA_ARB_Pos)           /* (FUSES_FCR_CTRLA) AHB Arbitration scheme Mask */
#define FUSES_FCR_CTRLA_ARB(value)            (FUSES_FCR_CTRLA_ARB_Msk & (_UINT32_(value) << FUSES_FCR_CTRLA_ARB_Pos)) /* Assigment of value for ARB in the FUSES_FCR_CTRLA register */
#define FUSES_FCR_CTRLA_FWS_Pos               _UINT32_(8)                                          /* (FUSES_FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Position */
#define FUSES_FCR_CTRLA_FWS_Msk               (_UINT32_(0xF) << FUSES_FCR_CTRLA_FWS_Pos)           /* (FUSES_FCR_CTRLA) Flash Access Time Defined in terms of AHB Clock Wait States Mask */
#define FUSES_FCR_CTRLA_FWS(value)            (FUSES_FCR_CTRLA_FWS_Msk & (_UINT32_(value) << FUSES_FCR_CTRLA_FWS_Pos)) /* Assigment of value for FWS in the FUSES_FCR_CTRLA register */
#define FUSES_FCR_CTRLA_ADRWS_Pos             _UINT32_(14)                                         /* (FUSES_FCR_CTRLA) Address Wait State Enable Position */
#define FUSES_FCR_CTRLA_ADRWS_Msk             (_UINT32_(0x1) << FUSES_FCR_CTRLA_ADRWS_Pos)         /* (FUSES_FCR_CTRLA) Address Wait State Enable Mask */
#define FUSES_FCR_CTRLA_ADRWS(value)          (FUSES_FCR_CTRLA_ADRWS_Msk & (_UINT32_(value) << FUSES_FCR_CTRLA_ADRWS_Pos)) /* Assigment of value for ADRWS in the FUSES_FCR_CTRLA register */
#define FUSES_FCR_CTRLA_AUTOWS_Pos            _UINT32_(15)                                         /* (FUSES_FCR_CTRLA) Automatic Wait State Enable. Position */
#define FUSES_FCR_CTRLA_AUTOWS_Msk            (_UINT32_(0x1) << FUSES_FCR_CTRLA_AUTOWS_Pos)        /* (FUSES_FCR_CTRLA) Automatic Wait State Enable. Mask */
#define FUSES_FCR_CTRLA_AUTOWS(value)         (FUSES_FCR_CTRLA_AUTOWS_Msk & (_UINT32_(value) << FUSES_FCR_CTRLA_AUTOWS_Pos)) /* Assigment of value for AUTOWS in the FUSES_FCR_CTRLA register */
#define FUSES_FCR_CTRLA_RDBUFWS_Pos           _UINT32_(16)                                         /* (FUSES_FCR_CTRLA) Data returned from the Read Buffer match the Flash Wait States Position */
#define FUSES_FCR_CTRLA_RDBUFWS_Msk           (_UINT32_(0xF) << FUSES_FCR_CTRLA_RDBUFWS_Pos)       /* (FUSES_FCR_CTRLA) Data returned from the Read Buffer match the Flash Wait States Mask */
#define FUSES_FCR_CTRLA_RDBUFWS(value)        (FUSES_FCR_CTRLA_RDBUFWS_Msk & (_UINT32_(value) << FUSES_FCR_CTRLA_RDBUFWS_Pos)) /* Assigment of value for RDBUFWS in the FUSES_FCR_CTRLA register */
#define FUSES_FCR_CTRLA_Msk                   _UINT32_(0x000FCF04)                                 /* (FUSES_FCR_CTRLA) Register Mask  */


/* -------- FUSES_RPMU_VREGCTRL : (FUSES Offset: 0xE8) (R/W 32) RPMU VREGCTRL Settings (BROM_PLLEN must be set) -------- */
#define FUSES_RPMU_VREGCTRL_VREGOUT_Pos       _UINT32_(0)                                          /* (FUSES_RPMU_VREGCTRL) VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN Position */
#define FUSES_RPMU_VREGCTRL_VREGOUT_Msk       (_UINT32_(0x3) << FUSES_RPMU_VREGCTRL_VREGOUT_Pos)   /* (FUSES_RPMU_VREGCTRL) VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN Mask */
#define FUSES_RPMU_VREGCTRL_VREGOUT(value)    (FUSES_RPMU_VREGCTRL_VREGOUT_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_VREGOUT_Pos)) /* Assigment of value for VREGOUT in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_VREGOUT_1p2v_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v.  */
#define   FUSES_RPMU_VREGCTRL_VREGOUT_1p0v_Val _UINT32_(0x1)                                        /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v.  */
#define   FUSES_RPMU_VREGCTRL_VREGOUT_0p8v_Val _UINT32_(0x2)                                        /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v.  */
#define FUSES_RPMU_VREGCTRL_VREGOUT_1p2v      (FUSES_RPMU_VREGCTRL_VREGOUT_1p2v_Val << FUSES_RPMU_VREGCTRL_VREGOUT_Pos) /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v. Position  */
#define FUSES_RPMU_VREGCTRL_VREGOUT_1p0v      (FUSES_RPMU_VREGCTRL_VREGOUT_1p0v_Val << FUSES_RPMU_VREGCTRL_VREGOUT_Pos) /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v. Position  */
#define FUSES_RPMU_VREGCTRL_VREGOUT_0p8v      (FUSES_RPMU_VREGCTRL_VREGOUT_0p8v_Val << FUSES_RPMU_VREGCTRL_VREGOUT_Pos) /* (FUSES_RPMU_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v. Position  */
#define FUSES_RPMU_VREGCTRL_OFFSTDBY_Pos      _UINT32_(2)                                          /* (FUSES_RPMU_VREGCTRL) Off in Standby Control for VREGSW[N-1]. Useful for Riverside only. Position */
#define FUSES_RPMU_VREGCTRL_OFFSTDBY_Msk      (_UINT32_(0x1) << FUSES_RPMU_VREGCTRL_OFFSTDBY_Pos)  /* (FUSES_RPMU_VREGCTRL) Off in Standby Control for VREGSW[N-1]. Useful for Riverside only. Mask */
#define FUSES_RPMU_VREGCTRL_OFFSTDBY(value)   (FUSES_RPMU_VREGCTRL_OFFSTDBY_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_OFFSTDBY_Pos)) /* Assigment of value for OFFSTDBY in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_OFFSTDBY_OFF_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) In standby mode, VREGSW1,2,3 are OFF  */
#define   FUSES_RPMU_VREGCTRL_OFFSTDBY_ON_Val _UINT32_(0x1)                                        /* (FUSES_RPMU_VREGCTRL) In standby mode, VREGSW1,2,3 are ON  */
#define FUSES_RPMU_VREGCTRL_OFFSTDBY_OFF      (FUSES_RPMU_VREGCTRL_OFFSTDBY_OFF_Val << FUSES_RPMU_VREGCTRL_OFFSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) In standby mode, VREGSW1,2,3 are OFF Position  */
#define FUSES_RPMU_VREGCTRL_OFFSTDBY_ON       (FUSES_RPMU_VREGCTRL_OFFSTDBY_ON_Val << FUSES_RPMU_VREGCTRL_OFFSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) In standby mode, VREGSW1,2,3 are ON Position  */
#define FUSES_RPMU_VREGCTRL_SRAM_VLD_Pos      _UINT32_(4)                                          /* (FUSES_RPMU_VREGCTRL) SRAM Valid (always clear) Position */
#define FUSES_RPMU_VREGCTRL_SRAM_VLD_Msk      (_UINT32_(0x1) << FUSES_RPMU_VREGCTRL_SRAM_VLD_Pos)  /* (FUSES_RPMU_VREGCTRL) SRAM Valid (always clear) Mask */
#define FUSES_RPMU_VREGCTRL_SRAM_VLD(value)   (FUSES_RPMU_VREGCTRL_SRAM_VLD_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_SRAM_VLD_Pos)) /* Assigment of value for SRAM_VLD in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_SRAM_VLD_CLEAR_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Always clear.  */
#define FUSES_RPMU_VREGCTRL_SRAM_VLD_CLEAR    (FUSES_RPMU_VREGCTRL_SRAM_VLD_CLEAR_Val << FUSES_RPMU_VREGCTRL_SRAM_VLD_Pos) /* (FUSES_RPMU_VREGCTRL) Always clear. Position  */
#define FUSES_RPMU_VREGCTRL_BKUP_VLD_Pos      _UINT32_(5)                                          /* (FUSES_RPMU_VREGCTRL) Backup Valid (always clear) Position */
#define FUSES_RPMU_VREGCTRL_BKUP_VLD_Msk      (_UINT32_(0x1) << FUSES_RPMU_VREGCTRL_BKUP_VLD_Pos)  /* (FUSES_RPMU_VREGCTRL) Backup Valid (always clear) Mask */
#define FUSES_RPMU_VREGCTRL_BKUP_VLD(value)   (FUSES_RPMU_VREGCTRL_BKUP_VLD_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_BKUP_VLD_Pos)) /* Assigment of value for BKUP_VLD in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_BKUP_VLD_CLEAR_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Always clear.  */
#define FUSES_RPMU_VREGCTRL_BKUP_VLD_CLEAR    (FUSES_RPMU_VREGCTRL_BKUP_VLD_CLEAR_Val << FUSES_RPMU_VREGCTRL_BKUP_VLD_Pos) /* (FUSES_RPMU_VREGCTRL) Always clear. Position  */
#define FUSES_RPMU_VREGCTRL_CPEN_Pos          _UINT32_(8)                                          /* (FUSES_RPMU_VREGCTRL) Charge Pump Enable and Auto-enable. Position */
#define FUSES_RPMU_VREGCTRL_CPEN_Msk          (_UINT32_(0x7) << FUSES_RPMU_VREGCTRL_CPEN_Pos)      /* (FUSES_RPMU_VREGCTRL) Charge Pump Enable and Auto-enable. Mask */
#define FUSES_RPMU_VREGCTRL_CPEN(value)       (FUSES_RPMU_VREGCTRL_CPEN_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_CPEN_Pos)) /* Assigment of value for CPEN in the FUSES_RPMU_VREGCTRL register */
#define FUSES_RPMU_VREGCTRL_ULDOEN_Pos        _UINT32_(12)                                         /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Regulator Enable Position */
#define FUSES_RPMU_VREGCTRL_ULDOEN_Msk        (_UINT32_(0x1) << FUSES_RPMU_VREGCTRL_ULDOEN_Pos)    /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Regulator Enable Mask */
#define FUSES_RPMU_VREGCTRL_ULDOEN(value)     (FUSES_RPMU_VREGCTRL_ULDOEN_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_ULDOEN_Pos)) /* Assigment of value for ULDOEN in the FUSES_RPMU_VREGCTRL register */
#define FUSES_RPMU_VREGCTRL_ULDOSTDBY_Pos     _UINT32_(13)                                         /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Regulator Configuration Position */
#define FUSES_RPMU_VREGCTRL_ULDOSTDBY_Msk     (_UINT32_(0x1) << FUSES_RPMU_VREGCTRL_ULDOSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Regulator Configuration Mask */
#define FUSES_RPMU_VREGCTRL_ULDOSTDBY(value)  (FUSES_RPMU_VREGCTRL_ULDOSTDBY_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_ULDOSTDBY_Pos)) /* Assigment of value for ULDOSTDBY in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_ULDOSTDBY_OFFINSTDBY_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.  */
#define   FUSES_RPMU_VREGCTRL_ULDOSTDBY_ONINSTDBY_Val _UINT32_(0x1)                                        /* (FUSES_RPMU_VREGCTRL) Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well.  */
#define FUSES_RPMU_VREGCTRL_ULDOSTDBY_OFFINSTDBY (FUSES_RPMU_VREGCTRL_ULDOSTDBY_OFFINSTDBY_Val << FUSES_RPMU_VREGCTRL_ULDOSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well. Position  */
#define FUSES_RPMU_VREGCTRL_ULDOSTDBY_ONINSTDBY (FUSES_RPMU_VREGCTRL_ULDOSTDBY_ONINSTDBY_Val << FUSES_RPMU_VREGCTRL_ULDOSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well. Position  */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos     _UINT32_(14)                                         /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Level Selection Position */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_Msk     (_UINT32_(0x3) << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos) /* (FUSES_RPMU_VREGCTRL) User LDO Voltage Level Selection Mask */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL(value)  (FUSES_RPMU_VREGCTRL_ULDOLEVEL_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos)) /* Assigment of value for ULDOLEVEL in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p2v_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Vout = 1.2v  */
#define   FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p5v_Val _UINT32_(0x1)                                        /* (FUSES_RPMU_VREGCTRL) Vout = 1.5v  */
#define   FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p8v_Val _UINT32_(0x2)                                        /* (FUSES_RPMU_VREGCTRL) Vout = 1.8v  */
#define   FUSES_RPMU_VREGCTRL_ULDOLEVEL_2p5v_Val _UINT32_(0x3)                                        /* (FUSES_RPMU_VREGCTRL) Vout = 2.5v  */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p2v    (FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p2v_Val << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos) /* (FUSES_RPMU_VREGCTRL) Vout = 1.2v Position  */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p5v    (FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p5v_Val << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos) /* (FUSES_RPMU_VREGCTRL) Vout = 1.5v Position  */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p8v    (FUSES_RPMU_VREGCTRL_ULDOLEVEL_1p8v_Val << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos) /* (FUSES_RPMU_VREGCTRL) Vout = 1.8v Position  */
#define FUSES_RPMU_VREGCTRL_ULDOLEVEL_2p5v    (FUSES_RPMU_VREGCTRL_ULDOLEVEL_2p5v_Val << FUSES_RPMU_VREGCTRL_ULDOLEVEL_Pos) /* (FUSES_RPMU_VREGCTRL) Vout = 2.5v Position  */
#define FUSES_RPMU_VREGCTRL_AVREGEN_Pos       _UINT32_(16)                                         /* (FUSES_RPMU_VREGCTRL) Additional Voltage Regulator Enable Position */
#define FUSES_RPMU_VREGCTRL_AVREGEN_Msk       (_UINT32_(0x7) << FUSES_RPMU_VREGCTRL_AVREGEN_Pos)   /* (FUSES_RPMU_VREGCTRL) Additional Voltage Regulator Enable Mask */
#define FUSES_RPMU_VREGCTRL_AVREGEN(value)    (FUSES_RPMU_VREGCTRL_AVREGEN_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_AVREGEN_Pos)) /* Assigment of value for AVREGEN in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_AVREGEN_OFF_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Always clear.  */
#define   FUSES_RPMU_VREGCTRL_AVREGEN_PLL_EN_Val _UINT32_(0x4)                                        /* (FUSES_RPMU_VREGCTRL) Always clear.  */
#define FUSES_RPMU_VREGCTRL_AVREGEN_OFF       (FUSES_RPMU_VREGCTRL_AVREGEN_OFF_Val << FUSES_RPMU_VREGCTRL_AVREGEN_Pos) /* (FUSES_RPMU_VREGCTRL) Always clear. Position  */
#define FUSES_RPMU_VREGCTRL_AVREGEN_PLL_EN    (FUSES_RPMU_VREGCTRL_AVREGEN_PLL_EN_Val << FUSES_RPMU_VREGCTRL_AVREGEN_Pos) /* (FUSES_RPMU_VREGCTRL) Always clear. Position  */
#define FUSES_RPMU_VREGCTRL_AVREGSTDBY_Pos    _UINT32_(24)                                         /* (FUSES_RPMU_VREGCTRL) Additional Voltage Regulator Configuration Position */
#define FUSES_RPMU_VREGCTRL_AVREGSTDBY_Msk    (_UINT32_(0x7) << FUSES_RPMU_VREGCTRL_AVREGSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) Additional Voltage Regulator Configuration Mask */
#define FUSES_RPMU_VREGCTRL_AVREGSTDBY(value) (FUSES_RPMU_VREGCTRL_AVREGSTDBY_Msk & (_UINT32_(value) << FUSES_RPMU_VREGCTRL_AVREGSTDBY_Pos)) /* Assigment of value for AVREGSTDBY in the FUSES_RPMU_VREGCTRL register */
#define   FUSES_RPMU_VREGCTRL_AVREGSTDBY_OFFINSTDBY_Val _UINT32_(0x0)                                        /* (FUSES_RPMU_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.  */
#define   FUSES_RPMU_VREGCTRL_AVREGSTDBY_ONINSTDBY_Val _UINT32_(0x1)                                        /* (FUSES_RPMU_VREGCTRL) Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well.  */
#define FUSES_RPMU_VREGCTRL_AVREGSTDBY_OFFINSTDBY (FUSES_RPMU_VREGCTRL_AVREGSTDBY_OFFINSTDBY_Val << FUSES_RPMU_VREGCTRL_AVREGSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well. Position  */
#define FUSES_RPMU_VREGCTRL_AVREGSTDBY_ONINSTDBY (FUSES_RPMU_VREGCTRL_AVREGSTDBY_ONINSTDBY_Val << FUSES_RPMU_VREGCTRL_AVREGSTDBY_Pos) /* (FUSES_RPMU_VREGCTRL) Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well. Position  */
#define FUSES_RPMU_VREGCTRL_Msk               _UINT32_(0x0707F737)                                 /* (FUSES_RPMU_VREGCTRL) Register Mask  */


