Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/fuses.h
/* -------- FUSES_PLL0_CTRL : (FUSES Offset: 0xEC) (R/W 32) PLL0 CTRL Settings (BROM_PLLEN must be set) -------- */
#define FUSES_PLL0_CTRL_ENABLE_Pos            _UINT32_(1)                                          /* (FUSES_PLL0_CTRL) PLL Enable Position */
#define FUSES_PLL0_CTRL_ENABLE_Msk            (_UINT32_(0x1) << FUSES_PLL0_CTRL_ENABLE_Pos)        /* (FUSES_PLL0_CTRL) PLL Enable Mask */
#define FUSES_PLL0_CTRL_ENABLE(value)         (FUSES_PLL0_CTRL_ENABLE_Msk & (_UINT32_(value) << FUSES_PLL0_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the FUSES_PLL0_CTRL register */
#define FUSES_PLL0_CTRL_WRTLOCK_Pos           _UINT32_(2)                                          /* (FUSES_PLL0_CTRL) Write Lock Position */
#define FUSES_PLL0_CTRL_WRTLOCK_Msk           (_UINT32_(0x1) << FUSES_PLL0_CTRL_WRTLOCK_Pos)       /* (FUSES_PLL0_CTRL) Write Lock Mask */
#define FUSES_PLL0_CTRL_WRTLOCK(value)        (FUSES_PLL0_CTRL_WRTLOCK_Msk & (_UINT32_(value) << FUSES_PLL0_CTRL_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the FUSES_PLL0_CTRL register */
#define FUSES_PLL0_CTRL_ONDEMAND_Pos          _UINT32_(7)                                          /* (FUSES_PLL0_CTRL) On Demand Control Position */
#define FUSES_PLL0_CTRL_ONDEMAND_Msk          (_UINT32_(0x1) << FUSES_PLL0_CTRL_ONDEMAND_Pos)      /* (FUSES_PLL0_CTRL) On Demand Control Mask */
#define FUSES_PLL0_CTRL_ONDEMAND(value)       (FUSES_PLL0_CTRL_ONDEMAND_Msk & (_UINT32_(value) << FUSES_PLL0_CTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the FUSES_PLL0_CTRL register */
#define FUSES_PLL0_CTRL_REFSEL_Pos            _UINT32_(8)                                          /* (FUSES_PLL0_CTRL) Reference selection Position */
#define FUSES_PLL0_CTRL_REFSEL_Msk            (_UINT32_(0x7) << FUSES_PLL0_CTRL_REFSEL_Pos)        /* (FUSES_PLL0_CTRL) Reference selection Mask */
#define FUSES_PLL0_CTRL_REFSEL(value)         (FUSES_PLL0_CTRL_REFSEL_Msk & (_UINT32_(value) << FUSES_PLL0_CTRL_REFSEL_Pos)) /* Assigment of value for REFSEL in the FUSES_PLL0_CTRL register */
#define   FUSES_PLL0_CTRL_REFSEL_GCLK_Val     _UINT32_(0x0)                                        /* (FUSES_PLL0_CTRL) Dedicated GCLK clock reference  */
#define   FUSES_PLL0_CTRL_REFSEL_XOSC_Val     _UINT32_(0x1)                                        /* (FUSES_PLL0_CTRL) XOSC clock reference  */
#define   FUSES_PLL0_CTRL_REFSEL_DFLL48M_Val  _UINT32_(0x2)                                        /* (FUSES_PLL0_CTRL) DFLL48M clock reference  */
#define FUSES_PLL0_CTRL_REFSEL_GCLK           (FUSES_PLL0_CTRL_REFSEL_GCLK_Val << FUSES_PLL0_CTRL_REFSEL_Pos) /* (FUSES_PLL0_CTRL) Dedicated GCLK clock reference Position  */
#define FUSES_PLL0_CTRL_REFSEL_XOSC           (FUSES_PLL0_CTRL_REFSEL_XOSC_Val << FUSES_PLL0_CTRL_REFSEL_Pos) /* (FUSES_PLL0_CTRL) XOSC clock reference Position  */
#define FUSES_PLL0_CTRL_REFSEL_DFLL48M        (FUSES_PLL0_CTRL_REFSEL_DFLL48M_Val << FUSES_PLL0_CTRL_REFSEL_Pos) /* (FUSES_PLL0_CTRL) DFLL48M clock reference Position  */
#define FUSES_PLL0_CTRL_BWSEL_Pos             _UINT32_(11)                                         /* (FUSES_PLL0_CTRL) Bandwidth selection Position */
#define FUSES_PLL0_CTRL_BWSEL_Msk             (_UINT32_(0x7) << FUSES_PLL0_CTRL_BWSEL_Pos)         /* (FUSES_PLL0_CTRL) Bandwidth selection Mask */
#define FUSES_PLL0_CTRL_BWSEL(value)          (FUSES_PLL0_CTRL_BWSEL_Msk & (_UINT32_(value) << FUSES_PLL0_CTRL_BWSEL_Pos)) /* Assigment of value for BWSEL in the FUSES_PLL0_CTRL register */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL0_Val    _UINT32_(0x0)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL1_Val    _UINT32_(0x1)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL2_Val    _UINT32_(0x2)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL3_Val    _UINT32_(0x3)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL4_Val    _UINT32_(0x4)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL5_Val    _UINT32_(0x5)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL6_Val    _UINT32_(0x6)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define   FUSES_PLL0_CTRL_BWSEL_BWSEL7_Val    _UINT32_(0x7)                                        /* (FUSES_PLL0_CTRL) TBD  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL0          (FUSES_PLL0_CTRL_BWSEL_BWSEL0_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL1          (FUSES_PLL0_CTRL_BWSEL_BWSEL1_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL2          (FUSES_PLL0_CTRL_BWSEL_BWSEL2_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL3          (FUSES_PLL0_CTRL_BWSEL_BWSEL3_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL4          (FUSES_PLL0_CTRL_BWSEL_BWSEL4_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL5          (FUSES_PLL0_CTRL_BWSEL_BWSEL5_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL6          (FUSES_PLL0_CTRL_BWSEL_BWSEL6_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_BWSEL_BWSEL7          (FUSES_PLL0_CTRL_BWSEL_BWSEL7_Val << FUSES_PLL0_CTRL_BWSEL_Pos) /* (FUSES_PLL0_CTRL) TBD Position  */
#define FUSES_PLL0_CTRL_Msk                   _UINT32_(0x00003F86)                                 /* (FUSES_PLL0_CTRL) Register Mask  */


/* -------- FUSES_PLL0_FBDIV : (FUSES Offset: 0xF0) (R/W 32) PLL0 FBDIV Settings (BROM_PLLEN must be set) -------- */
#define FUSES_PLL0_FBDIV_FBDIV_Pos            _UINT32_(0)                                          /* (FUSES_PLL0_FBDIV) PLL Feed-Back Divider Factor Position */
#define FUSES_PLL0_FBDIV_FBDIV_Msk            (_UINT32_(0x3FF) << FUSES_PLL0_FBDIV_FBDIV_Pos)      /* (FUSES_PLL0_FBDIV) PLL Feed-Back Divider Factor Mask */
#define FUSES_PLL0_FBDIV_FBDIV(value)         (FUSES_PLL0_FBDIV_FBDIV_Msk & (_UINT32_(value) << FUSES_PLL0_FBDIV_FBDIV_Pos)) /* Assigment of value for FBDIV in the FUSES_PLL0_FBDIV register */
#define FUSES_PLL0_FBDIV_Msk                  _UINT32_(0x000003FF)                                 /* (FUSES_PLL0_FBDIV) Register Mask  */


/* -------- FUSES_PLL0_REFDIV : (FUSES Offset: 0xF4) (R/W 32) PLL0 REFDIV Settings (BROM_PLLEN must be set) -------- */
#define FUSES_PLL0_REFDIV_REFDIV_Pos          _UINT32_(0)                                          /* (FUSES_PLL0_REFDIV) PLL reference division factor Position */
#define FUSES_PLL0_REFDIV_REFDIV_Msk          (_UINT32_(0x3F) << FUSES_PLL0_REFDIV_REFDIV_Pos)     /* (FUSES_PLL0_REFDIV) PLL reference division factor Mask */
#define FUSES_PLL0_REFDIV_REFDIV(value)       (FUSES_PLL0_REFDIV_REFDIV_Msk & (_UINT32_(value) << FUSES_PLL0_REFDIV_REFDIV_Pos)) /* Assigment of value for REFDIV in the FUSES_PLL0_REFDIV register */
#define FUSES_PLL0_REFDIV_Msk                 _UINT32_(0x0000003F)                                 /* (FUSES_PLL0_REFDIV) Register Mask  */


/* -------- FUSES_PLL0_POSTDIVA : (FUSES Offset: 0xF8) (R/W 32) PLL0 POSTDIVA Settings (BROM_PLLEN must be set) -------- */
#define FUSES_PLL0_POSTDIVA_POSTDIV_Pos       _UINT32_(0)                                          /* (FUSES_PLL0_POSTDIVA) PLL output 0 clock division factor Position */
#define FUSES_PLL0_POSTDIVA_POSTDIV_Msk       (_UINT32_(0x3F) << FUSES_PLL0_POSTDIVA_POSTDIV_Pos)  /* (FUSES_PLL0_POSTDIVA) PLL output 0 clock division factor Mask */
#define FUSES_PLL0_POSTDIVA_POSTDIV(value)    (FUSES_PLL0_POSTDIVA_POSTDIV_Msk & (_UINT32_(value) << FUSES_PLL0_POSTDIVA_POSTDIV_Pos)) /* Assigment of value for POSTDIV in the FUSES_PLL0_POSTDIVA register */
#define FUSES_PLL0_POSTDIVA_OUTEN_Pos         _UINT32_(7)                                          /* (FUSES_PLL0_POSTDIVA) PLL output 0 enable Position */
#define FUSES_PLL0_POSTDIVA_OUTEN_Msk         (_UINT32_(0x1) << FUSES_PLL0_POSTDIVA_OUTEN_Pos)     /* (FUSES_PLL0_POSTDIVA) PLL output 0 enable Mask */
#define FUSES_PLL0_POSTDIVA_OUTEN(value)      (FUSES_PLL0_POSTDIVA_OUTEN_Msk & (_UINT32_(value) << FUSES_PLL0_POSTDIVA_OUTEN_Pos)) /* Assigment of value for OUTEN in the FUSES_PLL0_POSTDIVA register */
#define FUSES_PLL0_POSTDIVA_Msk               _UINT32_(0x000000BF)                                 /* (FUSES_PLL0_POSTDIVA) Register Mask  */


